## Pandas set_index() is a method to set a List, Series or Data frame as index of a Data Frame. Index column can be set while making a data frame too.

import pandas as pd

In [4]:
df = pd.read_csv("titanic_train.csv")
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
s = df['Name']
s

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [8]:
# chunk of data
s1 = df['Name'][0:10]
s1

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

# providing index    s--> series

In [10]:
l = ['a','b','c','d','e','f','g','h','i','j']

In [19]:
s2 =pd.Series(s,index =l)
s2
# we had provides index name as given in list not 0,1,2,3

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
Name: Name, dtype: object

In [23]:
s3 =pd.Series(list(s1),index =l)
s3

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

# a, b,c,d  are named index while 0,1,2,3---- are default index

In [26]:
s3['d']

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

In [27]:
s3[3]

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

In [29]:
s4 =s3.append(s)
s4

C:\Users\asus\AppData\Local\Temp\ipykernel_20248\8267282.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s4 =s3.append(s)

a                                Braund, Mr. Owen Harris
b      Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                 Heikkinen, Miss. Laina
d           Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Length: 901, dtype: object

In [30]:
s4[0]           # s4[0] equivalent to s4['a']

'Braund, Mr. Owen Harris'

In [33]:
 series1 = pd.Series([3,4,5,6,7,8] , index = [2,6,7,3,8,9])
series1

2    3
6    4
7    5
3    6
8    7
9    8
dtype: int64

In [35]:
 series2 = pd.Series([34,45,56,67,78,90] , index = [8,9,6,5,4,5])
series2

8    34
9    45
6    56
5    67
4    78
5    90
dtype: int64

In [36]:
series3 = series1.append(series2)
series3

C:\Users\asus\AppData\Local\Temp\ipykernel_20248\3427229917.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series3 = series1.append(series2)

2     3
6     4
7     5
3     6
8     7
9     8
8    34
9    45
6    56
5    67
4    78
5    90
dtype: int64

In [39]:
series3[5]  # named index are taken here not default index

5    67
5    90
dtype: int64

In [42]:
series3[0 : 3] # in case of slicing default index are taken

2    3
6    4
7    5
dtype: int64

In [44]:
series2*series3   # in series2 2 ,3 not available so null

2       NaN
3       NaN
4    6084.0
5    4489.0
5    6030.0
5    6030.0
5    8100.0
6     224.0
6    3136.0
7       NaN
8     238.0
8    1156.0
9     360.0
9    2025.0
dtype: float64

In [46]:
series3+series2  # default index

2      NaN
3      NaN
4    156.0
5    134.0
5    157.0
5    157.0
5    180.0
6     60.0
6    112.0
7      NaN
8     41.0
8     68.0
9     53.0
9     90.0
dtype: float64